---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDir1Generic
source: html/14789dba-b85b-b56d-82d6-8e90af5736d3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDir1Generic Property

"Top/Exterior Major Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveTopDir1Generic { get; }
```